OpenNuvoton/M261BSP/SampleCode/MKROM/SecureOTADemo/NuBL2/NuBL2_lib0.c
/* Step 2. Calculate (NuBL2 * Host) ECDH key */
    /* Init ECC */
    if(NuBL_ECCInitCurve() != 0)
    {
        ret = -2001;
        goto _exit_GenCmdSessionKey;
    }

    /* Select NuBL2_priv * Host_pub */
    SetECCRegisters(0x00020000, NULL, (uint32_t *)&PubKey);

    /* Calculate ECDH shared key */
    if(NuBL_ECCGenerateECDHKey() != 0)
    {
        ret = -2002;
        goto _exit_GenCmdSessionKey;
    }

    /* Get ECDH shared key for follows AES encrypt/decrypt */
    memcpy(key, (void *)&CRPT->ECC_X1[0], sizeof(AESkey));
#if (DEBUG_CMD == 1)
    for(i=0; i<8; i++)
        NUBL_MSG("\tSharedKey: 0x%08x. (NuBL2_priv * Host_pub)\n", key[i]);
#endif

    ret = 0;

_exit_GenCmdSessionKey:
    SYS_ResetModule(CRPT_RST);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));

    return ret;
}

/*
    Identify public keys mached or mismatch
        mode:
            0: p32Buf means public keys
            1: p32Buf means public key Hash
    Return:
        bit-0:
            0: No NuBL32 pubic key;
            1: NuBL32 public key match
        bit-2:
            0: No Host pubic key;
            1: Host public key match
*/
int32_t IdentifyPublicKey(uint32_t *p32Buf, int32_t mode)
{
    volatile int32_t    i, ret = -1000, sts = 0;
    uint32_t            *keybuf, base, len, start, end;
    ECC_PUBKEY_T        PubKey, *pInPubKey;
    uint32_t            AESkey[8], Hash[8];

    if(mode == -1)
        return ret;

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&Hash, 0x0, sizeof(Hash));
    pInPubKey = (ECC_PUBKEY_T *)p32Buf;

    GetNuBL2AES256Key(AESkey);

    /* decrypt NuBL32 public key */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
    base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */

    keybuf = (uint32_t *)&PubKey;
    for(i=0; i<(len/4); i++)
        keybuf[i] = FMC_Read(base + (i*4));
    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_IdentifyPublicKey;
    }
    if(mode == 0)
    {
        /* Identify NuBL32 public key */
        if(memcmp(&PubKey.au32Key0[0], &pInPubKey->au32Key0[0], sizeof(ECC_PUBKEY_T)) == 0)
        {
            sts |= BIT0;
        }
    }
    else
    {
        start = (uint32_t )&PubKey.au32Key0[0];
        end   = start + len;
        NuBL_CalculateSHA256(start, end, (uint32_t *)&Hash[0], SHA_ONESHOT, SHA_SRC_SRAM);
        /* Identify NuBL32 public key Hash */
        if(memcmp(&Hash[0], &pInPubKey->au32Key0[0], sizeof(Hash)) == 0)
        {
            sts |= BIT0;
        }
    }


    /* decrypt Host public key */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_HostEnCryptPubKeyBase;  /* declared in LoadHostKey.s */
    base = (uint32_t)&g_HostEnCryptPubKeyBase;  /* encrypted Host pub key address */

    keybuf = (uint32_t *)&PubKey;
    for(i=0; i<(len/4); i++)
        keybuf[i] = FMC_Read(base + (i*4));
    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_IdentifyPublicKey;
    }
    if(mode == 0)
    {
        /* Identify Host public key */
        if(memcmp(&PubKey.au32Key0[0], &pInPubKey->au32Key0[0], sizeof(ECC_PUBKEY_T)) == 0)
        {
            sts |= BIT2;
        }
    }
    else
    {
        start = (uint32_t )&PubKey.au32Key0[0];
        end   = start + len;
        NuBL_CalculateSHA256(start, end, (uint32_t *)&Hash[0], SHA_ONESHOT, SHA_SRC_SRAM);
        /* Identify Host public key Hash */
        if(memcmp(&Hash[0], &pInPubKey->au32Key0[0], sizeof(Hash)) == 0)
        {
            sts |= BIT2;
        }
    }

    ret = sts;

_exit_IdentifyPublicKey:
    SYS_ResetModule(CRPT_RST);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&Hash, 0x0, sizeof(Hash));

    return ret;
}

/**
  * @brief      Perform NuBL2 to verify the hash value of Host public key
  * @param[in]  u32KeyHash  key hash of HOST
  * @retval     1,2,3       Success, Bit0:NuBL32
  * @retval     -1      Failed
  * @details    This function is used to perform identify, authenticate and verify F/W integrity of NuBL32. \n
  *             Flow: \n
  *                 1. Decrypt(use NuBL2 AES Key )Key Storage to get NuBL32x public key \n
  *                 2. Decrypt(use NuBL2&NuBL3x ECDH key) NuBL3x info \n
  *                 3. Identify NuBL3x public key \n
  */
int32_t VerifyNuBL3xKeyHash(uint32_t * pu32KeyHash)
{
    volatile int32_t    i, ret = -1000;
    uint32_t            *keybuf, *infobuf, base, len, start, end;
    ECC_PUBKEY_T        PubKey;
    FW_INFO_T           FwInfo;
    uint32_t            AESkey[8];
    uint32_t            au32HashBuf[8];

    NUBL_MSG("\nNuBL2 verify NuBL3x.\n\n");

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&FwInfo, 0x0, sizeof(FW_INFO_T));

    infobuf = (uint32_t *)&FwInfo;

    /* reset crypto */
    SYS->IPRST0 |= SYS_IPRST0_CRPTRST_Msk;
    SYS->IPRST0 &= ~SYS_IPRST0_CRPTRST_Msk;
    NVIC_DisableIRQ(CRPT_IRQn);

    GetNuBL2AES256Key(AESkey);
/* Step 1. Decrypt NuBL3x public key */
    for(i=0; i<8; i++)
        NUBL_MSG("\tSharedKey: 0x%08x. (NuBL2_priv * NuBL1_pub)\n", AESkey[i]);

    /* Get encrypted NuBL3x public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
    base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */

    keybuf = (uint32_t *)&PubKey;
    for(i=0; i<(len/4); i++)
        keybuf[i] = FMC_Read(base + (i*4));

    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Decrypt NuBL32 public key [Done]\n\n");

    start = (uint32_t )&keybuf[0];
    end   = start + len;
    NuBL_CalculateSHA256(start, end, (uint32_t *)&au32HashBuf[0], SHA_ONESHOT, SHA_SRC_SRAM);

    /* verify NuBL32 key hash */
    if(memcmp(&au32HashBuf, pu32KeyHash, sizeof(au32HashBuf)) == 0)
    {
        NUBL_MSG("Identify NuBL32 public key [PASS]\n\n");
        ret = BIT0;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }

    ret = 0;

_exit_NuBL2_ExecuteVerifyNuBL3x:
    SYS_ResetModule(CRPT_RST);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&FwInfo, 0x0, sizeof(FW_INFO_T));

    return ret;
}

/*** (C) COPYRIGHT 2019 Nuvoton Technology Corp. ***/
